content/posts/diagrams/nbytes_diagram.d2
style: {
  fill: transparent
}

direction: right

nbytes: "nbytes \n (sT)"
w8list: "W8.t list \n (T)"

nbytes -> w8list: "val"
w8list -> nbytes: "insubd"
