diagrams/subtypes.mmd
flowchart LR
    nbytes("nbytes") -- val --> w8list("W8.t list")
    w8list -- insubd --- nbytes
